docs/model.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-02-12 Fri 11:42 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>model.lean</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Vaibhav Karve" />
<link rel="stylesheet" type="text/css" href="https://gongzhitaao.org/orgcss/org.css"/>
</head>
<body>
<div id="content">
<h1 class="title">model.lean
<br />
<span class="subtitle">Model theory formalized in Lean  <br> <a href="type_theory.html">Link to file: type theory</a></span>
</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgb3017b4">1. <span class="todo TODO">TODO</span> Arity \(n\) functions and their API</a></li>
<li><a href="#org37ae52e">2. Languages</a>
<ul>
<li><a href="#orgfb0cae2">2.1. Definition and implementation</a></li>
<li><a href="#orgbb62efe">2.2. Constants</a></li>
<li><a href="#org999a4a0">2.3. DLO language</a></li>
<li><a href="#org27fca37">2.4. <code>lang</code> is an inhabited type</a></li>
</ul>
</li>
<li><a href="#org182fa71">3. Structures</a>
<ul>
<li><a href="#org46e19cc">3.1. <span class="todo TODO">TODO</span> <code>struc</code> is inhabited</a></li>
</ul>
</li>
<li><a href="#org738b26a">4. <span class="todo TODO">TODO</span> Exbedding between structures</a>
<ul>
<li><a href="#org62ca680">4.1. Embedding</a></li>
<li><a href="#org6d2339c">4.2. Embeddings are inhabited</a></li>
<li><a href="#orgb4281a1">4.3. Isomorphism</a></li>
<li><a href="#org42bf4a6">4.4. Isomorphisms are inhabited</a></li>
<li><a href="#org49f5a85">4.5. Cardinality of structure</a></li>
</ul>
</li>
<li><a href="#orga69bed2">5. <span class="todo TODO">TODO</span> Terms</a>
<ul>
<li><a href="#org8fa09b9">5.1. Definition of terms</a></li>
<li><a href="#org5b816f5">5.2. Terms are inhabited</a></li>
<li><a href="#org170d182">5.3. Variables in a term in term</a></li>
<li><a href="#orga11a72b">5.4. Number of variables in a term</a></li>
<li><a href="#org6310635">5.5. Term interpretation</a></li>
</ul>
</li>
<li><a href="#org3d636ab">6. <span class="todo TODO">TODO</span> Term substitution</a></li>
<li><a href="#org08f414d">7. <span class="todo TODO">TODO</span> Formulas and Sentences</a></li>
<li><a href="#orgdfe2657">8. <span class="todo TODO">TODO</span> Satisfiability and models</a></li>
<li><a href="#org82480fb">9. Bibliography</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgb3017b4" class="outline-2">
<h2 id="orgb3017b4"><span class="section-number-2">1</span> <span class="todo TODO">TODO</span> Arity \(n\) functions and their API</h2>
</div>

<div id="outline-container-org37ae52e" class="outline-2">
<h2 id="org37ae52e"><span class="section-number-2">2</span> Languages</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgfb0cae2" class="outline-3">
<h3 id="orgfb0cae2"><span class="section-number-3">2.1</span> Definition and implementation</h3>
<div class="outline-text-3" id="text-2-1">
<p>
A <i>language</i> is given by specifying "functions'', "relations" and "constants"
along with the arity of each function and each relation. Note that languages are
purely syntactic &#x2013; they have no sematics (i.e. meaning assigned to them).
</p>

<p>
The words "functions", "relations", and "constant" are written in quotes here
to emphasize that these are just the names we give to these pieces of data. We
could equivalently have called them F, R, and C. They do not yet behave like
actual functions, relations and constants because we have not added any semantic
information to them. For now, they are merely symbols in our language.
</p>

<p>
In lean, we use <b>structure</b> to bundle data (think of it like classes in Python).
So, we bundle functions and relations in a structure and call it a language.
</p>

<p>
Implementation details &#x2013;
</p>
<ol class="org-ol">
<li>Constants are included in the mathematical definition of languages but not in
out immediate implementation of <code>lang</code> (see subsection that follows for an
explanation).</li>
<li>The definition says that every function and relation is supposed to have an
arity.  In our implementation, we invert this and instead stipulate that
every arity (i.e. every natural number) has a type assiciated with it. What
type is that? The type corresponding to \((n : ℕ)\) is the type of all
\(n\)-arity functions in our language.</li>
<li>Thus, \(F : ℕ → Type\) is the function that returns a type for each natural
number. Similarly for \(R\).</li>
<li>We also note that since each <code>lang</code> contains an <code>F</code> and an <code>R</code> that
themselves return types, the type of <code>lang</code> itself is <code>Type 1</code>, which one
universe higher than <code>Type</code>.  In other words, <code>Type</code> is too small to contain
<code>lang</code>, so languages must live in a higher universe.  This is a small detail
that does not affect the rest of treatment of model theory in any way.</li>
</ol>
</div>
</div>

<div id="outline-container-orgbb62efe" class="outline-3">
<h3 id="orgbb62efe"><span class="section-number-3">2.2</span> Constants</h3>
<div class="outline-text-3" id="text-2-2">
<p>
We define the constants in a language to simply be the \(0\)-arity functions
i.e. <code>L.F 0</code>. (Think of constants as simply a convenient way to refer to
\(0\)-arity functions). They do not add any new information to the <code>lang</code>
already defined above.
</p>
<ol class="org-ol">
<li>This uses the fact that natural numbers in Lean begin at \(0\), not \(1\).</li>
<li>This is the reason why we did not need to include constants in out
implementation of languages.</li>
</ol>
</div>
</div>

<div id="outline-container-org999a4a0" class="outline-3">
<h3 id="org999a4a0"><span class="section-number-3">2.3</span> DLO language</h3>
<div class="outline-text-3" id="text-2-3">
<p>
The language that is of primary interest to us is the language of dense linear
ordering.
</p>

<p>
A <i>dense linear ordering (without endpoints)</i> (DLO) is a language containing a
single binary relation symbol \((\le)\) satisfying some axioms. The exact axioms
are not important at the moment since axioms are semantic statements, while we
are interested only in syntactic statements right now.
</p>

<p>
Thus, a DLO's <code>lang</code> is a language with no constant, no functions and only one
binary relation. (Refer to the type theory primer for the meaning of <code>empty</code>,
<code>unit</code> etc.).
</p>
</div>
</div>

<div id="outline-container-org27fca37" class="outline-3">
<h3 id="org27fca37"><span class="section-number-3">2.4</span> <code>lang</code> is an inhabited type</h3>
<div class="outline-text-3" id="text-2-4">
<p>
We can now declare that <code>lang</code> is an inhabited (read: nonempty) type since we
know that <code>DLO_lang</code> is a <code>lang</code>. This declaration is made using Lean's
<code>instance</code> keyword. This declaration automatically makes the nonemptiness of
<code>lang</code> available as a fact to Lean's typeclass resolver if needed.
</p>
</div>
</div>
</div>

<div id="outline-container-org182fa71" class="outline-2">
<h2 id="org182fa71"><span class="section-number-2">3</span> Structures</h2>
<div class="outline-text-2" id="text-3">
<p>
Given a language \(L\), an <i>\(L\)-structure</i> is a bundle of the following 4
pieces of data.
</p>

<ol class="org-ol">
<li>A set called the universe or domain. We implement this as a type rather than
a set because Lean is based on type theory.</li>

<li>For every symbolic function of arity \(n\) in \(L\), we must have a
corresponding real function of arity \(n\) acting on the univere of \(M\). To
implement this, we map every <code>(f : L.F n)</code> to <code>Func univ v</code>. Since we need a
name for this map, we name it <code>F</code>. Thanks to namespaces in lean, the full
name for this map is <code>struc.F</code> or <code>M.F</code> where \(M\) is a <code>struc</code>, and hence
there is no chance of mixing this up with <code>lang.F</code> or <code>L.F</code>.</li>

<li>For every symbolic relation of arity \(n\) in \(L\), we must have a
corresponding real relation of arity \(n\) on the univere of \(M\). At this
point, it is useful to recall that the proper definition of a relation is as
a subset if the domain set. What do I mean?  While we like to think of a
binary relation for example as a relation "between" elements of our set, it
is in fact better to view it as a subset of the cartesian product of the
domain with itself. Pairs belonging to this subset are related while pairs
not belonging are not.  Similarly, \(3\)-ary relations are subsets of
<code>univ³</code>, and so on. Thus we map each element <code>(r : L.R n)</code> to <code>set (vector
   univ n)</code>, i.e. we map to a set of length \(n\) vectors of <code>univ</code>.</li>

<li>For every symbolic constant in \(L\), we must have a corresponding constant
in the universe/domain. Since <code>L.C</code> is implemented outside of \(L\), we
similarly implement <code>M.C</code> outside of \(M\). It is implemented merely as the
\(0\)-arity function <code>M.F 0</code>.</li>
</ol>
</div>

<div id="outline-container-org46e19cc" class="outline-3">
<h3 id="org46e19cc"><span class="section-number-3">3.1</span> <span class="todo TODO">TODO</span> <code>struc</code> is inhabited</h3>
</div>
</div>

<div id="outline-container-org738b26a" class="outline-2">
<h2 id="org738b26a"><span class="section-number-2">4</span> <span class="todo TODO">TODO</span> Exbedding between structures</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org62ca680" class="outline-3">
<h3 id="org62ca680"><span class="section-number-3">4.1</span> Embedding</h3>
</div>
<div id="outline-container-org6d2339c" class="outline-3">
<h3 id="org6d2339c"><span class="section-number-3">4.2</span> Embeddings are inhabited</h3>
</div>
<div id="outline-container-orgb4281a1" class="outline-3">
<h3 id="orgb4281a1"><span class="section-number-3">4.3</span> Isomorphism</h3>
</div>
<div id="outline-container-org42bf4a6" class="outline-3">
<h3 id="org42bf4a6"><span class="section-number-3">4.4</span> Isomorphisms are inhabited</h3>
</div>
<div id="outline-container-org49f5a85" class="outline-3">
<h3 id="org49f5a85"><span class="section-number-3">4.5</span> Cardinality of structure</h3>
</div>
</div>
<div id="outline-container-orga69bed2" class="outline-2">
<h2 id="orga69bed2"><span class="section-number-2">5</span> <span class="todo TODO">TODO</span> Terms</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org8fa09b9" class="outline-3">
<h3 id="org8fa09b9"><span class="section-number-3">5.1</span> Definition of terms</h3>
</div>
<div id="outline-container-org5b816f5" class="outline-3">
<h3 id="org5b816f5"><span class="section-number-3">5.2</span> Terms are inhabited</h3>
</div>
<div id="outline-container-org170d182" class="outline-3">
<h3 id="org170d182"><span class="section-number-3">5.3</span> Variables in a term in term</h3>
</div>
<div id="outline-container-orga11a72b" class="outline-3">
<h3 id="orga11a72b"><span class="section-number-3">5.4</span> Number of variables in a term</h3>
</div>
<div id="outline-container-org6310635" class="outline-3">
<h3 id="org6310635"><span class="section-number-3">5.5</span> Term interpretation</h3>
</div>
</div>
<div id="outline-container-org3d636ab" class="outline-2">
<h2 id="org3d636ab"><span class="section-number-2">6</span> <span class="todo TODO">TODO</span> Term substitution</h2>
</div>
<div id="outline-container-org08f414d" class="outline-2">
<h2 id="org08f414d"><span class="section-number-2">7</span> <span class="todo TODO">TODO</span> Formulas and Sentences</h2>
</div>
<div id="outline-container-orgdfe2657" class="outline-2">
<h2 id="orgdfe2657"><span class="section-number-2">8</span> <span class="todo TODO">TODO</span> Satisfiability and models</h2>
</div>
<div id="outline-container-org82480fb" class="outline-2">
<h2 id="org82480fb"><span class="section-number-2">9</span> Bibliography</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Vaibhav Karve</p>
<p class="date">Created: 2021-02-12 Fri 11:42</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
